Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_iot_central_bg96/NonSecure/firmware/src/packs/PIC32CM5164LS60100_DFP/component/fuses.h
/* -------- FUSES_BOCOR_WORD_31 : (FUSES Offset: 0x7C) (R/W 32) BOCOR Page Word 31 -------- */
#define FUSES_BOCOR_WORD_31_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_31) BOCOR Page Word 31  Reset Value */

#define FUSES_BOCOR_WORD_31_BOOTROM_UDS_3_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_31) DICE UDS Key bits 127:96 Position */
#define FUSES_BOCOR_WORD_31_BOOTROM_UDS_3_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_31_BOOTROM_UDS_3_Pos) /* (FUSES_BOCOR_WORD_31) DICE UDS Key bits 127:96 Mask */
#define FUSES_BOCOR_WORD_31_BOOTROM_UDS_3(value) (FUSES_BOCOR_WORD_31_BOOTROM_UDS_3_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_31_BOOTROM_UDS_3_Pos)) /* Assigment of value for BOOTROM_UDS_3 in the FUSES_BOCOR_WORD_31 register */
#define FUSES_BOCOR_WORD_31_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_31) Register Mask  */


/* -------- FUSES_BOCOR_WORD_32 : (FUSES Offset: 0x80) (R/W 32) BOCOR Page Word 32 -------- */
#define FUSES_BOCOR_WORD_32_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_32) BOCOR Page Word 32  Reset Value */

#define FUSES_BOCOR_WORD_32_BOOTROM_UDS_4_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_32) DICE UDS Key bits 159:128 Position */
#define FUSES_BOCOR_WORD_32_BOOTROM_UDS_4_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_32_BOOTROM_UDS_4_Pos) /* (FUSES_BOCOR_WORD_32) DICE UDS Key bits 159:128 Mask */
#define FUSES_BOCOR_WORD_32_BOOTROM_UDS_4(value) (FUSES_BOCOR_WORD_32_BOOTROM_UDS_4_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_32_BOOTROM_UDS_4_Pos)) /* Assigment of value for BOOTROM_UDS_4 in the FUSES_BOCOR_WORD_32 register */
#define FUSES_BOCOR_WORD_32_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_32) Register Mask  */


/* -------- FUSES_BOCOR_WORD_33 : (FUSES Offset: 0x84) (R/W 32) BOCOR Page Word 33 -------- */
#define FUSES_BOCOR_WORD_33_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_33) BOCOR Page Word 33  Reset Value */

#define FUSES_BOCOR_WORD_33_BOOTROM_UDS_5_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_33) DICE UDS Key bits 191:160 Position */
#define FUSES_BOCOR_WORD_33_BOOTROM_UDS_5_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_33_BOOTROM_UDS_5_Pos) /* (FUSES_BOCOR_WORD_33) DICE UDS Key bits 191:160 Mask */
#define FUSES_BOCOR_WORD_33_BOOTROM_UDS_5(value) (FUSES_BOCOR_WORD_33_BOOTROM_UDS_5_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_33_BOOTROM_UDS_5_Pos)) /* Assigment of value for BOOTROM_UDS_5 in the FUSES_BOCOR_WORD_33 register */
#define FUSES_BOCOR_WORD_33_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_33) Register Mask  */


/* -------- FUSES_BOCOR_WORD_34 : (FUSES Offset: 0x88) (R/W 32) BOCOR Page Word 34 -------- */
#define FUSES_BOCOR_WORD_34_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_34) BOCOR Page Word 34  Reset Value */

#define FUSES_BOCOR_WORD_34_BOOTROM_UDS_6_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_34) DICE UDS Key bits 223:192 Position */
#define FUSES_BOCOR_WORD_34_BOOTROM_UDS_6_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_34_BOOTROM_UDS_6_Pos) /* (FUSES_BOCOR_WORD_34) DICE UDS Key bits 223:192 Mask */
#define FUSES_BOCOR_WORD_34_BOOTROM_UDS_6(value) (FUSES_BOCOR_WORD_34_BOOTROM_UDS_6_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_34_BOOTROM_UDS_6_Pos)) /* Assigment of value for BOOTROM_UDS_6 in the FUSES_BOCOR_WORD_34 register */
#define FUSES_BOCOR_WORD_34_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_34) Register Mask  */


/* -------- FUSES_BOCOR_WORD_35 : (FUSES Offset: 0x8C) (R/W 32) BOCOR Page Word 35 -------- */
#define FUSES_BOCOR_WORD_35_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_35) BOCOR Page Word 35  Reset Value */

#define FUSES_BOCOR_WORD_35_BOOTROM_UDS_7_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_35) DICE UDS Key bits 255:224 Position */
#define FUSES_BOCOR_WORD_35_BOOTROM_UDS_7_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_35_BOOTROM_UDS_7_Pos) /* (FUSES_BOCOR_WORD_35) DICE UDS Key bits 255:224 Mask */
#define FUSES_BOCOR_WORD_35_BOOTROM_UDS_7(value) (FUSES_BOCOR_WORD_35_BOOTROM_UDS_7_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_35_BOOTROM_UDS_7_Pos)) /* Assigment of value for BOOTROM_UDS_7 in the FUSES_BOCOR_WORD_35 register */
#define FUSES_BOCOR_WORD_35_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_35) Register Mask  */


/* -------- FUSES_BOCOR_WORD_36 : (FUSES Offset: 0x90) (R/W 32) BOCOR Page Word 36 -------- */
#define FUSES_BOCOR_WORD_36_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_36) BOCOR Page Word 36  Reset Value */

#define FUSES_BOCOR_WORD_36_BOOTROM_IOPROTKEY_0_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_36) ECC608 IO Protection Key bits 31:0 Position */
#define FUSES_BOCOR_WORD_36_BOOTROM_IOPROTKEY_0_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_36_BOOTROM_IOPROTKEY_0_Pos) /* (FUSES_BOCOR_WORD_36) ECC608 IO Protection Key bits 31:0 Mask */
#define FUSES_BOCOR_WORD_36_BOOTROM_IOPROTKEY_0(value) (FUSES_BOCOR_WORD_36_BOOTROM_IOPROTKEY_0_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_36_BOOTROM_IOPROTKEY_0_Pos)) /* Assigment of value for BOOTROM_IOPROTKEY_0 in the FUSES_BOCOR_WORD_36 register */
#define FUSES_BOCOR_WORD_36_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_36) Register Mask  */


/* -------- FUSES_BOCOR_WORD_37 : (FUSES Offset: 0x94) (R/W 32) BOCOR Page Word 37 -------- */
#define FUSES_BOCOR_WORD_37_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_37) BOCOR Page Word 37  Reset Value */

#define FUSES_BOCOR_WORD_37_BOOTROM_IOPROTKEY_1_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_37) ECC608 IO Protection Key bits 63:32 Position */
#define FUSES_BOCOR_WORD_37_BOOTROM_IOPROTKEY_1_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_37_BOOTROM_IOPROTKEY_1_Pos) /* (FUSES_BOCOR_WORD_37) ECC608 IO Protection Key bits 63:32 Mask */
#define FUSES_BOCOR_WORD_37_BOOTROM_IOPROTKEY_1(value) (FUSES_BOCOR_WORD_37_BOOTROM_IOPROTKEY_1_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_37_BOOTROM_IOPROTKEY_1_Pos)) /* Assigment of value for BOOTROM_IOPROTKEY_1 in the FUSES_BOCOR_WORD_37 register */
#define FUSES_BOCOR_WORD_37_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_37) Register Mask  */


/* -------- FUSES_BOCOR_WORD_38 : (FUSES Offset: 0x98) (R/W 32) BOCOR Page Word 38 -------- */
#define FUSES_BOCOR_WORD_38_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_38) BOCOR Page Word 38  Reset Value */

#define FUSES_BOCOR_WORD_38_BOOTROM_IOPROTKEY_2_Pos _UINT32_(0)                                          /* (FUSES_BOCOR_WORD_38) ECC608 IO Protection Key bits 95:64 Position */
#define FUSES_BOCOR_WORD_38_BOOTROM_IOPROTKEY_2_Msk (_UINT32_(0xFFFFFFFF) << FUSES_BOCOR_WORD_38_BOOTROM_IOPROTKEY_2_Pos) /* (FUSES_BOCOR_WORD_38) ECC608 IO Protection Key bits 95:64 Mask */
#define FUSES_BOCOR_WORD_38_BOOTROM_IOPROTKEY_2(value) (FUSES_BOCOR_WORD_38_BOOTROM_IOPROTKEY_2_Msk & (_UINT32_(value) << FUSES_BOCOR_WORD_38_BOOTROM_IOPROTKEY_2_Pos)) /* Assigment of value for BOOTROM_IOPROTKEY_2 in the FUSES_BOCOR_WORD_38 register */
#define FUSES_BOCOR_WORD_38_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_BOCOR_WORD_38) Register Mask  */


/* -------- FUSES_BOCOR_WORD_39 : (FUSES Offset: 0x9C) (R/W 32) BOCOR Page Word 39 -------- */
#define FUSES_BOCOR_WORD_39_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOCOR_WORD_39) BOCOR Page Word 39  Reset Value */

