Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_iot_central_bg96/NonSecure/firmware/src/packs/PIC32CM5164LS60100_DFP/component/fuses.h
#define FUSES_USER_WORD_6_NONSECC_SERCOM_Pos  _UINT32_(1)                                          /* (FUSES_USER_WORD_6 Position) SERCOMx Non-Secure */
#define FUSES_USER_WORD_6_NONSECC_SERCOM_Msk  (_UINT32_(0x3F) << FUSES_USER_WORD_6_NONSECC_SERCOM_Pos) /* (FUSES_USER_WORD_6 Mask) NONSECC_SERCOM */
#define FUSES_USER_WORD_6_NONSECC_SERCOM(value) (FUSES_USER_WORD_6_NONSECC_SERCOM_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_SERCOM_Pos)) 
#define FUSES_USER_WORD_6_NONSECC_TC_Pos      _UINT32_(7)                                          /* (FUSES_USER_WORD_6 Position) TCx Non-Secure */
#define FUSES_USER_WORD_6_NONSECC_TC_Msk      (_UINT32_(0x7) << FUSES_USER_WORD_6_NONSECC_TC_Pos)  /* (FUSES_USER_WORD_6 Mask) NONSECC_TC */
#define FUSES_USER_WORD_6_NONSECC_TC(value)   (FUSES_USER_WORD_6_NONSECC_TC_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_TC_Pos)) 
#define FUSES_USER_WORD_6_NONSECC_TCC_Pos     _UINT32_(10)                                         /* (FUSES_USER_WORD_6 Position) TCCx Non-Secure */
#define FUSES_USER_WORD_6_NONSECC_TCC_Msk     (_UINT32_(0xF) << FUSES_USER_WORD_6_NONSECC_TCC_Pos) /* (FUSES_USER_WORD_6 Mask) NONSECC_TCC */
#define FUSES_USER_WORD_6_NONSECC_TCC(value)  (FUSES_USER_WORD_6_NONSECC_TCC_Msk & (_UINT32_(value) << FUSES_USER_WORD_6_NONSECC_TCC_Pos)) 

/* -------- FUSES_USER_WORD_7 : (FUSES Offset: 0x1C) (R/W 32) USER Page Word 7 -------- */
#define FUSES_USER_WORD_7_RESETVALUE          _UINT32_(0x00)                                       /*  (FUSES_USER_WORD_7) USER Page Word 7  Reset Value */

#define FUSES_USER_WORD_7_BOOTROM_CDIROFFSET_Pos _UINT32_(0)                                          /* (FUSES_USER_WORD_7) Location of CDI value when DICE is programmed Position */
#define FUSES_USER_WORD_7_BOOTROM_CDIROFFSET_Msk (_UINT32_(0xFFFFFFFF) << FUSES_USER_WORD_7_BOOTROM_CDIROFFSET_Pos) /* (FUSES_USER_WORD_7) Location of CDI value when DICE is programmed Mask */
#define FUSES_USER_WORD_7_BOOTROM_CDIROFFSET(value) (FUSES_USER_WORD_7_BOOTROM_CDIROFFSET_Msk & (_UINT32_(value) << FUSES_USER_WORD_7_BOOTROM_CDIROFFSET_Pos)) /* Assigment of value for BOOTROM_CDIROFFSET in the FUSES_USER_WORD_7 register */
#define FUSES_USER_WORD_7_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (FUSES_USER_WORD_7) Register Mask  */


/* -------- FUSES_USER_WORD_8 : (FUSES Offset: 0x20) (R/W 32) USER Page Word 8 -------- */
#define FUSES_USER_WORD_8_RESETVALUE          _UINT32_(0xE87673B6)                                 /*  (FUSES_USER_WORD_8) USER Page Word 8  Reset Value */

#define FUSES_USER_WORD_8_BOOTROM_USERCRC_Pos _UINT32_(0)                                          /* (FUSES_USER_WORD_8) CRC for USER[1,2,3] DWORDS Position */
#define FUSES_USER_WORD_8_BOOTROM_USERCRC_Msk (_UINT32_(0xFFFFFFFF) << FUSES_USER_WORD_8_BOOTROM_USERCRC_Pos) /* (FUSES_USER_WORD_8) CRC for USER[1,2,3] DWORDS Mask */
#define FUSES_USER_WORD_8_BOOTROM_USERCRC(value) (FUSES_USER_WORD_8_BOOTROM_USERCRC_Msk & (_UINT32_(value) << FUSES_USER_WORD_8_BOOTROM_USERCRC_Pos)) /* Assigment of value for BOOTROM_USERCRC in the FUSES_USER_WORD_8 register */
#define FUSES_USER_WORD_8_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (FUSES_USER_WORD_8) Register Mask  */


/** \brief FUSES register offsets definitions */
#define FUSES_SW_CALIB_WORD_0_REG_OFST _UINT32_(0x00)      /* (FUSES_SW_CALIB_WORD_0) SW_CALIB Page Word 0 Offset */
#define FUSES_BOCOR_WORD_0_REG_OFST    _UINT32_(0x00)      /* (FUSES_BOCOR_WORD_0) BOCOR Page Word 0 Offset */
#define FUSES_BOCOR_WORD_1_REG_OFST    _UINT32_(0x04)      /* (FUSES_BOCOR_WORD_1) BOCOR Page Word 1 Offset */
#define FUSES_BOCOR_WORD_2_REG_OFST    _UINT32_(0x08)      /* (FUSES_BOCOR_WORD_2) BOCOR Page Word 2 Offset */
#define FUSES_BOCOR_WORD_4_REG_OFST    _UINT32_(0x10)      /* (FUSES_BOCOR_WORD_4) BOCOR Page Word 4 Offset */
#define FUSES_BOCOR_WORD_5_REG_OFST    _UINT32_(0x14)      /* (FUSES_BOCOR_WORD_5) BOCOR Page Word 5 Offset */
#define FUSES_BOCOR_WORD_6_REG_OFST    _UINT32_(0x18)      /* (FUSES_BOCOR_WORD_6) BOCOR Page Word 6 Offset */
#define FUSES_BOCOR_WORD_7_REG_OFST    _UINT32_(0x1C)      /* (FUSES_BOCOR_WORD_7) BOCOR Page Word 7 Offset */
#define FUSES_BOCOR_WORD_8_REG_OFST    _UINT32_(0x20)      /* (FUSES_BOCOR_WORD_8) BOCOR Page Word 8 Offset */
#define FUSES_BOCOR_WORD_9_REG_OFST    _UINT32_(0x24)      /* (FUSES_BOCOR_WORD_9) BOCOR Page Word 9 Offset */
#define FUSES_BOCOR_WORD_10_REG_OFST   _UINT32_(0x28)      /* (FUSES_BOCOR_WORD_10) BOCOR Page Word 10 Offset */
#define FUSES_BOCOR_WORD_11_REG_OFST   _UINT32_(0x2C)      /* (FUSES_BOCOR_WORD_11) BOCOR Page Word 11 Offset */
#define FUSES_BOCOR_WORD_12_REG_OFST   _UINT32_(0x30)      /* (FUSES_BOCOR_WORD_12) BOCOR Page Word 12 Offset */
#define FUSES_BOCOR_WORD_13_REG_OFST   _UINT32_(0x34)      /* (FUSES_BOCOR_WORD_13) BOCOR Page Word 13 Offset */
#define FUSES_BOCOR_WORD_14_REG_OFST   _UINT32_(0x38)      /* (FUSES_BOCOR_WORD_14) BOCOR Page Word 14 Offset */
#define FUSES_BOCOR_WORD_15_REG_OFST   _UINT32_(0x3C)      /* (FUSES_BOCOR_WORD_15) BOCOR Page Word 15 Offset */
#define FUSES_BOCOR_WORD_16_REG_OFST   _UINT32_(0x40)      /* (FUSES_BOCOR_WORD_16) BOCOR Page Word 16 Offset */
#define FUSES_BOCOR_WORD_17_REG_OFST   _UINT32_(0x44)      /* (FUSES_BOCOR_WORD_17) BOCOR Page Word 17 Offset */
#define FUSES_BOCOR_WORD_18_REG_OFST   _UINT32_(0x48)      /* (FUSES_BOCOR_WORD_18) BOCOR Page Word 18 Offset */
#define FUSES_BOCOR_WORD_19_REG_OFST   _UINT32_(0x4C)      /* (FUSES_BOCOR_WORD_19) BOCOR Page Word 19 Offset */
#define FUSES_BOCOR_WORD_20_REG_OFST   _UINT32_(0x50)      /* (FUSES_BOCOR_WORD_20) BOCOR Page Word 20 Offset */
#define FUSES_BOCOR_WORD_21_REG_OFST   _UINT32_(0x54)      /* (FUSES_BOCOR_WORD_21) BOCOR Page Word 21 Offset */
#define FUSES_BOCOR_WORD_22_REG_OFST   _UINT32_(0x58)      /* (FUSES_BOCOR_WORD_22) BOCOR Page Word 22 Offset */
#define FUSES_BOCOR_WORD_23_REG_OFST   _UINT32_(0x5C)      /* (FUSES_BOCOR_WORD_23) BOCOR Page Word 23 Offset */
#define FUSES_BOCOR_WORD_24_REG_OFST   _UINT32_(0x60)      /* (FUSES_BOCOR_WORD_24) BOCOR Page Word 24 Offset */
#define FUSES_BOCOR_WORD_25_REG_OFST   _UINT32_(0x64)      /* (FUSES_BOCOR_WORD_25) BOCOR Page Word 25 Offset */
#define FUSES_BOCOR_WORD_26_REG_OFST   _UINT32_(0x68)      /* (FUSES_BOCOR_WORD_26) BOCOR Page Word 26 Offset */
#define FUSES_BOCOR_WORD_27_REG_OFST   _UINT32_(0x6C)      /* (FUSES_BOCOR_WORD_27) BOCOR Page Word 27 Offset */
#define FUSES_BOCOR_WORD_28_REG_OFST   _UINT32_(0x70)      /* (FUSES_BOCOR_WORD_28) BOCOR Page Word 28 Offset */
#define FUSES_BOCOR_WORD_29_REG_OFST   _UINT32_(0x74)      /* (FUSES_BOCOR_WORD_29) BOCOR Page Word 29 Offset */
#define FUSES_BOCOR_WORD_30_REG_OFST   _UINT32_(0x78)      /* (FUSES_BOCOR_WORD_30) BOCOR Page Word 30 Offset */
#define FUSES_BOCOR_WORD_31_REG_OFST   _UINT32_(0x7C)      /* (FUSES_BOCOR_WORD_31) BOCOR Page Word 31 Offset */
#define FUSES_BOCOR_WORD_32_REG_OFST   _UINT32_(0x80)      /* (FUSES_BOCOR_WORD_32) BOCOR Page Word 32 Offset */
#define FUSES_BOCOR_WORD_33_REG_OFST   _UINT32_(0x84)      /* (FUSES_BOCOR_WORD_33) BOCOR Page Word 33 Offset */
#define FUSES_BOCOR_WORD_34_REG_OFST   _UINT32_(0x88)      /* (FUSES_BOCOR_WORD_34) BOCOR Page Word 34 Offset */
#define FUSES_BOCOR_WORD_35_REG_OFST   _UINT32_(0x8C)      /* (FUSES_BOCOR_WORD_35) BOCOR Page Word 35 Offset */
#define FUSES_BOCOR_WORD_36_REG_OFST   _UINT32_(0x90)      /* (FUSES_BOCOR_WORD_36) BOCOR Page Word 36 Offset */
#define FUSES_BOCOR_WORD_37_REG_OFST   _UINT32_(0x94)      /* (FUSES_BOCOR_WORD_37) BOCOR Page Word 37 Offset */
#define FUSES_BOCOR_WORD_38_REG_OFST   _UINT32_(0x98)      /* (FUSES_BOCOR_WORD_38) BOCOR Page Word 38 Offset */
#define FUSES_BOCOR_WORD_39_REG_OFST   _UINT32_(0x9C)      /* (FUSES_BOCOR_WORD_39) BOCOR Page Word 39 Offset */
#define FUSES_BOCOR_WORD_40_REG_OFST   _UINT32_(0xA0)      /* (FUSES_BOCOR_WORD_40) BOCOR Page Word 40 Offset */
#define FUSES_BOCOR_WORD_41_REG_OFST   _UINT32_(0xA4)      /* (FUSES_BOCOR_WORD_41) BOCOR Page Word 41 Offset */
#define FUSES_BOCOR_WORD_42_REG_OFST   _UINT32_(0xA8)      /* (FUSES_BOCOR_WORD_42) BOCOR Page Word 42 Offset */
#define FUSES_BOCOR_WORD_43_REG_OFST   _UINT32_(0xAC)      /* (FUSES_BOCOR_WORD_43) BOCOR Page Word 43 Offset */
#define FUSES_BOCOR_WORD_56_REG_OFST   _UINT32_(0xE0)      /* (FUSES_BOCOR_WORD_56) BOCOR Page Word 56 Offset */
#define FUSES_BOCOR_WORD_57_REG_OFST   _UINT32_(0xE4)      /* (FUSES_BOCOR_WORD_57) BOCOR Page Word 57 Offset */
#define FUSES_BOCOR_WORD_58_REG_OFST   _UINT32_(0xE8)      /* (FUSES_BOCOR_WORD_58) BOCOR Page Word 58 Offset */
#define FUSES_BOCOR_WORD_59_REG_OFST   _UINT32_(0xEC)      /* (FUSES_BOCOR_WORD_59) BOCOR Page Word 59 Offset */
#define FUSES_BOCOR_WORD_60_REG_OFST   _UINT32_(0xF0)      /* (FUSES_BOCOR_WORD_60) BOCOR Page Word 60 Offset */
#define FUSES_BOCOR_WORD_61_REG_OFST   _UINT32_(0xF4)      /* (FUSES_BOCOR_WORD_61) BOCOR Page Word 61 Offset */
#define FUSES_BOCOR_WORD_62_REG_OFST   _UINT32_(0xF8)      /* (FUSES_BOCOR_WORD_62) BOCOR Page Word 62 Offset */
#define FUSES_BOCOR_WORD_63_REG_OFST   _UINT32_(0xFC)      /* (FUSES_BOCOR_WORD_63) BOCOR Page Word 63 Offset */
#define FUSES_OTP1_WORD_0_REG_OFST     _UINT32_(0x00)      /* (FUSES_OTP1_WORD_0) OTP1 Page Word 0 Offset */
#define FUSES_OTP1_WORD_1_REG_OFST     _UINT32_(0x04)      /* (FUSES_OTP1_WORD_1) OTP1 Page Word 1 Offset */
#define FUSES_OTP2_WORD_1_REG_OFST     _UINT32_(0x04)      /* (FUSES_OTP2_WORD_1) OTP2 Page Word 1 Offset */
#define FUSES_USER_WORD_0_REG_OFST     _UINT32_(0x00)      /* (FUSES_USER_WORD_0) USER Page Word 0 Offset */
#define FUSES_USER_WORD_1_REG_OFST     _UINT32_(0x04)      /* (FUSES_USER_WORD_1) USER Page Word 1 Offset */
#define FUSES_USER_WORD_2_REG_OFST     _UINT32_(0x08)      /* (FUSES_USER_WORD_2) USER Page Word 2 Offset */
#define FUSES_USER_WORD_3_REG_OFST     _UINT32_(0x0C)      /* (FUSES_USER_WORD_3) USER Page Word 3 Offset */
#define FUSES_USER_WORD_4_REG_OFST     _UINT32_(0x10)      /* (FUSES_USER_WORD_4) USER Page Word 4 Offset */
#define FUSES_USER_WORD_5_REG_OFST     _UINT32_(0x14)      /* (FUSES_USER_WORD_5) USER Page Word 5 Offset */
#define FUSES_USER_WORD_6_REG_OFST     _UINT32_(0x18)      /* (FUSES_USER_WORD_6) USER Page Word 6 Offset */
#define FUSES_USER_WORD_7_REG_OFST     _UINT32_(0x1C)      /* (FUSES_USER_WORD_7) USER Page Word 7 Offset */
#define FUSES_USER_WORD_8_REG_OFST     _UINT32_(0x20)      /* (FUSES_USER_WORD_8) USER Page Word 8 Offset */

